In [10]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
import csv

df = pd.read_csv('examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [2]:
pd.read_table('examples/ex1.csv', sep = ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
pd.read_csv('examples/ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
parsed = pd.read_csv('examples/csv_mindex.csv',
                    index_col = ['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [13]:
pd.read_csv('examples/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [15]:
result = pd.read_csv('examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [17]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [18]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
sentinels = {'message' : ['foo', 'NA'], 'something' : ['two']}
pd.read_csv('examples/ex5.csv', na_values=sentinels)
# column마다 다른 NA 값을 사전값으로 넘겨서 처리할 수도 있다.

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [20]:
pd.read_csv('examples/ex5.csv', nrows=2)
# 파일 전체를 읽는 대신 처음 몇 줄만 읽어보고 싶다면 nrows 옵션을 주면 된다

  something  a  b    c  d message
0       one  1  2  3.0  4     NaN
1       two  5  6  NaN  8   world

In [5]:
data = pd.read_csv('examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [25]:
data.to_csv('examples/out.csv')

In [4]:
import sys
data.to_csv(sys.stdout, sep='|')
# to_csv 메서드로 데이터를 구분자로 구분된 형식으로 파일에 쓸 수 있다.

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [28]:
data.to_csv(sys.stdout, na_rep = 'NULL')
# 결과에서 누락된 값은 비어 있는 문자열로 나타나는데 이것도 원하는 값을 지정 가능하다.

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [29]:
data.to_csv(sys.stdout, index = False, header = False)
# row 와 column 이름을 포함하지 않을 수도 있다.

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [32]:
data.to_csv(sys.stdout, index = False, columns = ['b', 'c', 'a'])
# column의 일부만 기록 가능하며 순서도 지정할 수 있다.

b,c,a
2,3.0,1
6,,5
10,11.0,9

In [33]:
dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv('examples/tseries.csv')

In [38]:
# !
import csv
f = open('examples/ex7.csv')
reader = csv.reader(f)

In [39]:
for line in reader:
    print(line)

['"a"', '"b"', '"c"']
['"1"', '"2"', '"3"']
['"1"', '"2"', '"3"']

In [37]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))
# 파일을 읽어 줄 단위 리스트로 저장한다.
header, values = lines[0], lines[1:] # 헤더와 데이터를 구분한다.
data_dict = {h: v for h,v in zip(header, zip(*values))}
# zip(*values) : 사전 표기법과 row를 column으로 전치해준다.
data_dict

{'"a"': ('"1"', '"1"'), '"b"': ('"2"', '"2"'), '"c"': ('"3"', '"3"')}

In [40]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
    
reader = csv.reader(f, dialect = my_dialect)

In [42]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect = my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

In [2]:
# JSON 데이터 (JSON : JavaScript Object Notation)
# : 웹 브라우저와 다른 애플리케이션이 HTTP 요청으로 데이터를 보낼 때 널리 사용하는 표준 파일 형식

obj = """
{"name" : "Wes",
"places_lived" : ["United Stated", "Spain", "Germany"],
"pet" : null,
"siblings" : [{"name" : "Scott", "age" : 30, "pets" : ["Zeus", "Zuko"]},
{"name" : "Katie", "age" : 38, "pets" : ["Sixes", "Stache", "Cisco"]}]
}
"""

In [72]:
import json
result = json.loads(obj) # json.loads() : JSON 문자열을 파이썬 형태로 변환해준다.
result

{'name': 'Wes',
 'places_lived': ['United Stated', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [46]:
asjson = json.dumps(result)

In [47]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [48]:
!cat examples/example.json

cat: examples/example.json: No such file or directory

In [51]:
conda install lxml

Collecting package metadata (current_repodata.json): done
Solving environment: done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [16]:
tables = pd.read_html('examples/banklist.htm')
len(tables)

1

In [34]:
failures = tables[0]
failures.head()

,0,1,2,3,4,5
0,banklist,banklist,banklist,banklist,banklist,banklist
1,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
2,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb",16-Oct-20
3,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.",3-Apr-20
4,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,14-Feb-20

In [40]:
# XML은 계층적 구조와 메타데이터를 포함하는 중첩된 데이터 구조를 지원하는 또 다른 유명한 데이터 형식이다.
from lxml import objectify
# lxml.objectify로 파일을 파싱한 후 getroot 함수로 XML 파일의 루트노드에 대한 참조를 얻어올 수 있다.

path = 'examples/datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 'DESIRED_CHANGE', 'DECIMAL_PLACES']
for elt in root.INDICATOR: # root.INDICATOR로 모든 <INDICATOR> XML 엘리먼트를 끄집어낼 수 있다.
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [41]:
perf = pd.DataFrame(data)
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95,96,95,95
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95,96.3,95,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95,96.8,95,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95,96.6,95,95.8

In [42]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()
root

In [43]:
root.get('href')

'http://www.google.com'

In [44]:
root.text

'Google'

In [46]:
# 이진 데이터 형식
# 데이터를 효율적으로 저장하는 가장 손쉬운 방법은 파이썬에 기본으로 내장되어 있는 pickle 직렬화를 통해 데이터를 이진 형식으로 저장하는 것이다.

frame = pd.read_csv('examples/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [48]:
frame.to_pickle('examples/frame_pickle') # pickle로 직렬화
pd.read_pickle('examples/frame_pickle') # pickle로 직렬화된 객체를 불러올 수 있다.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [51]:
# HDF5(Hierarchical Data Format) : 계층적 데이터 형식. 대량의 과학 계산용 배열 데이터를 저장하기 위해 고안된 파일 포맷.
#                                : 실시간 압축을 지원, 반복패턴을 가진 데이터를 더 효과적으로 저장 가능.

frame = pd.DataFrame({'a' : np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [61]:
store['obj1']

           a
0  -0.344082
1   0.189510
2   0.869023
3   1.959833
4   1.226672
..       ...
95  0.250581
96 -0.908841
97 -1.150229
98  0.881264
99 -0.654863

[100 rows x 1 columns]

In [60]:
store.put('obj2', frame, format = 'table')
store.select('obj2', where=['index >= 10 and index <=15'])

           a
10  1.475998
11 -0.511395
12  0.335212
13  0.199308
14  0.496779
15  0.704517

In [67]:
xlsx = pd.ExcelFile('examples/pydata-book-2nd-edition/examples/ex1.xlsx')
pd.read_excel(xlsx,'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [68]:
frame = pd.read_excel('examples/pydata-book-2nd-edition/examples/ex1.xlsx')
frame

# 한 파일에서 여러 시트를 읽어오려면 ExcelFile을 생성하면 빠르지만 간단하게는 pd.read_excel에 파일 이름만 넘겨도 된다.

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [78]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [79]:
data = resp.json()
data[0]['title']

'BUG: MemoryError: Unable to allocate'

In [80]:
issues = pd.DataFrame(data, columns = ['number', 'title', 'labels', 'state'])
issues

,number,title,labels,state
0,39629,BUG: MemoryError: Unable to allocate,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
1,39628,ENH: vector methods for conversion from Period...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
2,39627,CLN: Styler HTML output adopt structured code ...,[],open
3,39626,BUG: Styler HTML is unstructured,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
4,39625,CLN: Use kwargs instead of kwds in apply funct...,"[{'id': 697792067, 'node_id': 'MDU6TGFiZWw2OTc...",open
5,39624,CI/TST: Disallow usage of pytest.xfail,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
6,39623,BUG: Series.loc raising KeyError for Iterator ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
7,39622,PERF: slowdown in groupby/resample mean() method,"[{'id': 8935311, 'node_id': 'MDU6TGFiZWw4OTM1M...",open
8,39621,BUG: Calling pop() on a row inside apply() aff...,"[{'id': 697792067, 'node_id': 'MDU6TGFiZWw2OTc...",open
9,39620,"REF: remove Float64Index get_loc, __contains__",[],open
10,39619,"BUG: Series[int].__setitem__(mask, td64_or_dt6...",[],open
11,39618,REF: simplify BlockManager.quantile,[],open
12,39617,BUG: .query() using uint64 column fails with T...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
13,39616,BUG: astyping Categorical to nullable integer ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
14,39615,BUG: fix Categorical.astype for dtype=np.int32...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
15,39614,QST: Why is indexing with a reversed list poss...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
16,39612,[ArrayManager] REF: Implement concat with rein...,"[{'id': 49094459, 'node_id': 'MDU6TGFiZWw0OTA5...",open
17,39611,"BUG:weeks = df.groupby(['CUSTOMER_ID', 'SALES_...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
18,39610,BUG: Grouping by frequency doesn't preserve or...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
19,39609,QST: Is it intended that empty dictionary aggr...,"[{'id': 1954720290, 'node_id': 'MDU6TGFiZWwxOT...",open
20,39607,BUG: `max` and `min` returns incorrect result,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
21,39606,BUG: quantile for ExtensionArray,[],open
22,39605,REGR: appending to existing excel file created...,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open
23,39603,DEP: Bump minimum version of openpyxl to 3.0.0,"[{'id': 527603109, 'node_id': 'MDU6TGFiZWw1Mjc...",open
24,39602,ENH: Index Left Alignment Option in a DataFrame,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
25,39600,ENH: implement EA.replace,[],open
26,39599,BUG: read_excel with engine=openpyxl is includ...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,39597,GH38482 : added warning in docs to show -1 wil...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
28,39595,BUG: Series.where behaves inconsistent,"[{'id': 32815646, 'node_id': 'MDU6TGFiZWwzMjgx...",open
29,39594,DOC: Group optional dependencies by relevant t...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open

In [ ]:
# DataBase와 함께 사용하기
import sqlite3
# 파이썬 내장 sqlite3 드라이버를 사용해서 SQLite 데이터 베이스를 이용할 수 있다.

query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL,         d INTEGER
);"""
con = sqlite3.connect('mydata.sqlite')
con.execute(query)

In [89]:
data = [('Atlanta', 'Georgia', 1.25, 6),
       ('Tallahassee', 'Florida', 2.6, 3),
       ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)

In [90]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [91]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [92]:
pd.DataFrame(rows, columns = [x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [96]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

Empty DataFrame
Columns: [a, b, c, d]
Index: []